Revit 2027 API
Line.CreateUnbound Method
 Creates a new instance of an unbound linear curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Line CreateUnbound(
	XYZ origin,
	XYZ direction
)
Public Shared Function CreateUnbound (
	origin As XYZ,
	direction As XYZ
) As Line
public:
static Line^ CreateUnbound(
	XYZ^ origin,
	XYZ^ direction
)
static member CreateUnbound :
        origin : XYZ *
        direction : XYZ -> Line
Parameters
origin XYZ
 The origin of the unbound line.
direction XYZ
 The direction of the unbound line.
Return Value
Line
 The new unbound line.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was NULL
ArgumentOutOfRangeException |  direction has zero length.
ArgumentsInconsistentException |  Vector and origin cannot form a proper unbound line.
Example
// define start point and direction for unbound line
XYZ startPoint = new XYZ(0, 0, 0);
XYZ directionPt = new XYZ(10, 10, 10);
// create line
Line line = Line.CreateUnbound(startPoint, directionPt);
See Also
Reference
Line Class
Autodesk.Revit.DB Namespace